/*
 * Authors:
 * Aleksandr Lysikov <alexander.lysikov@demlabs.net>
 * DeM Labs Inc.   https://demlabs.net
 * Cellframe Network https://gitlab.demlabs.net/cellframe
 * Copyright  (c) 2017-2018
 * All rights reserved.

 This file is part of DAP (Deus Applications Prototypes) the open source project

 DAP (Deus Applicaions Prototypes) is free software: you can redistribute it and/or modify
 it under the terms of the GNU General Public License as published by
 the Free Software Foundation, either version 3 of the License, or
 (at your option) any later version.

 DAP is distributed in the hope that it will be useful,
 but WITHOUT ANY WARRANTY; without even the implied warranty of
 MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 GNU General Public License for more details.

 You should have received a copy of the GNU General Public License
 along with any DAP based project.  If not, see <http://www.gnu.org/licenses/>.
 */

#include <stdlib.h>
#include <stdint.h>
#include <errno.h>
#include <fcntl.h>
#include <stdbool.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <unistd.h>
#include <limits.h>
#ifdef DAP_BUILD_WITH_ZIP
#include <zip.h>
#endif
#if (OS_TARGET == OS_MACOS)
    #include <stdio.h>
#else
    #include <malloc.h>
#endif
#include <string.h>
#include <sys/stat.h>
#include <stdarg.h>

#ifdef _WIN32
#include <windows.h>
#include <io.h>
#endif

#include "dap_common.h"
#include "dap_string.h"
#include "dap_strfuncs.h"
#include "dap_file_utils.h"


        if(strcmp(l_dirp->d_name, ".") && strcmp(l_dirp->d_name, "..")) {
            char *l_fullname = dap_build_filename(a_inputdir, l_dirp->d_name, NULL);
            if(dap_dir_test(l_fullname)) {

                if(zip_dir_add(a_zipper, l_fullname + dap_strlen(a_startdir) + 1, ZIP_FL_ENC_UTF_8) < 0) {
                    log_it(L_ERROR, "Failed to add directory to zip: %s", zip_strerror(a_zipper));
                    DAP_DELETE(l_fullname);
                    closedir(l_dir);
                    return false;
                }
                walk_directory(a_startdir, l_fullname, a_zipper);
            } else {
                zip_source_t *l_source = zip_source_file(a_zipper, l_fullname, 0, 0);
                if(l_source == NULL) {
                    log_it(L_ERROR, "Failed to add file to zip: %s", zip_strerror(a_zipper));
                    closedir(l_dir);
                    DAP_DELETE(l_fullname);
                    return false;
                }
                if(zip_file_add(a_zipper, l_fullname + dap_strlen(a_startdir) + 1, l_source, ZIP_FL_ENC_UTF_8) < 0) {
                    zip_source_free(l_source);
                    log_it(L_ERROR, "Failed to add file to zip: %s", zip_strerror(a_zipper));
                    DAP_DELETE(l_fullname);
                    closedir(l_dir);
                    return false;
                }
            }
            DAP_DELETE(l_fullname);
        }
    }
    closedir(l_dir);
    return true;
}

/*
 * Pack a directory to zip file
 *
 * @a_inputdir: input dir
 * @a_output_filename: output zip file path
 *
 * Returns: True, if successfully
 */
bool dap_zip_directory(const char *a_inputdir, const char *a_output_filename)
{
    int l_errorp;
    zip_t *l_zipper = zip_open(a_output_filename, ZIP_CREATE | ZIP_EXCL, &l_errorp);
    if(l_zipper == NULL) {
        zip_error_t l_ziperror;
        zip_error_init_with_code(&l_ziperror, l_errorp);
        if(l_errorp == ZIP_ER_EXISTS) {
            if(!remove(a_output_filename))
                return dap_zip_directory(a_inputdir, a_output_filename);
        }
        log_it(L_ERROR, "Failed to open output file %s: %s ", a_output_filename, zip_error_strerror(&l_ziperror));
        return false;
    }

    bool l_ret = walk_directory(a_inputdir, a_inputdir, l_zipper);

    zip_close(l_zipper);
    return l_ret;
}
#endif


// For TAR
/* values used in typeflag field */
#define REGTYPE  '0'            /* regular file */
#define AREGTYPE '\0'           /* regular file */
#define LNKTYPE  '1'            /* link */
#define SYMTYPE  '2'            /* reserved */
#define CHRTYPE  '3'            /* character special */
#define BLKTYPE  '4'            /* block special */
#define DIRTYPE  '5'            /* directory */
#define FIFOTYPE '6'            /* FIFO special */
#define CONTTYPE '7'            /* reserved */

#define BLOCKSIZE 512
/* The checksum field is filled with this while the checksum is computed.  */
#define CHKBLANKS   "        "  /* 8 blanks, no null */

struct tar_header
{ /* byte offset */
    char name[100]; /*   0 */
    char mode[8]; /* 100 */
    char uid[8]; /* 108 */
    char gid[8]; /* 116 */
    char size[12]; /* 124 */
    char mtime[12]; /* 136 */
    char chksum[8]; /* 148 */
    char typeflag; /* 156 */
    char linkname[100]; /* 157 */
    char magic[6]; /* 257 */
    char version[2]; /* 263 */
    char uname[32]; /* 265 */
    char gname[32]; /* 297 */
    char devmajor[8]; /* 329 */
    char devminor[8]; /* 337 */
    char prefix[155]; /* 345 */
/* 500 */
};

union tar_buffer {
    char buffer[BLOCKSIZE];
    struct tar_header header;
};

/*
 * Pack a directory with contents into a TAR archive
 *
 * @a_outfile: output file descriptor
 * @a_fname: file path relative archive start
 * @a_fpath: full dir path
 *
 * Returns: True, if successfully
 */
static bool s_tar_dir_add(int a_outfile, const char *a_fname, const char *a_fpath)
{
    union tar_buffer l_buffer;
    if(!a_outfile)
        return false;
    char *l_filebuf = NULL;
    size_t l_filelen = 0;
    struct stat l_stat_info;
    int remaining = l_filelen; // how much is left to write
    // fill header
    memset(&l_buffer, 0, BLOCKSIZE);
    // Trim a directory name if it's over 100 bytes
    size_t l_fname_len = MIN(dap_strlen(a_fname), sizeof(l_buffer.header.name) - 1);
    strncpy(l_buffer.header.name, a_fname, l_fname_len);
    l_buffer.header.name[l_fname_len] = '/';
    sprintf(l_buffer.header.mode, "0000777");
